In [1]:
import mod_sql

In [2]:
# 대면
db = mod_sql.Database('172.16.12.149', 'ubion', '1234')
# 비대면
# db = mod_sql.Database('darkpreist.iptime.org', 'ubion', '1234')

In [8]:
### emp table에서 S로 시작하는 사원의 정보 출력
sql = """
    select 
    * 
    from 
    emp 
    where 
    ENAME like '%%S%%'
"""
db.executeAll(sql)

    EMPNO  ENAME      JOB     MGR    HIREDATE     SAL  COMM  DEPTNO
0  7369.0  SMITH    CLERK  7902.0  1980-12-17   800.0   0.0    20.0
1  7566.0  JONES  MANAGER  7839.0  1981-04-02  2975.0   0.0    20.0
2  7788.0  SCOTT  ANALYST  7566.0  1987-06-28  3000.0   0.0    20.0
3  7876.0  ADAMS    CLERK  7788.0  1987-07-13  1100.0   0.0    20.0
4  7900.0  JAMES    CLERK  7698.0  1981-12-03   950.0   0.0    30.0